insert-text-as-the-first-line-of-another-file.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-04-04 Wed 12:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>把一行文字作为另一个已存在文件的第一行</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">把一行文字作为另一个已存在文件的第一行</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb44aa9">1. sed</a></li>
<li><a href="#org4d18536">2. echo cat mv</a></li>
<li><a href="#org086d0fa">3. echo cat spong</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcb44aa9" class="outline-2">
<h2 id="orgcb44aa9"><span class="section-number-2">1</span> sed</h2>
<div class="outline-text-2" id="text-1">
<p>
Use sed's insert (i) option which will insert the text in the preceding line.
</p>

<p>
sed '1 i\
</p>

<p>
Question author's update:
</p>

<p>
To make it edit the file in place - with gnu sed - I had to add the -i option:
</p>

<p>
sed -i '1 i\anything' file
</p>

<p>
Also syntax
</p>

<p>
sed  -i '1i text' filename
</p>

<p>
<a href="https://unix.stackexchange.com/questions/99350/how-to-insert-text-before-the-first-line-of-a-file">https://unix.stackexchange.com/questions/99350/how-to-insert-text-before-the-first-line-of-a-file</a>
</p>

<p>
sed -i '1s/^/task goes here\n/' todo.txt
</p>

<p>
or
</p>

<p>
sed -i '1itask goes here' todo.txt
</p>

<p>
<a href="https://superuser.com/questions/246837/how-do-i-add-text-to-the-beginning-of-a-file-in-bash">https://superuser.com/questions/246837/how-do-i-add-text-to-the-beginning-of-a-file-in-bash</a>
</p>
</div>
</div>
<div id="outline-container-org4d18536" class="outline-2">
<h2 id="org4d18536"><span class="section-number-2">2</span> echo cat mv</h2>
<div class="outline-text-2" id="text-2">
<p>
echo 'task goes here' | cat - todo.txt &gt; temp &amp;&amp; mv temp todo.txt
</p>

<p>
<a href="https://superuser.com/questions/246837/how-do-i-add-text-to-the-beginning-of-a-file-in-bash">https://superuser.com/questions/246837/how-do-i-add-text-to-the-beginning-of-a-file-in-bash</a>
</p>
</div>
</div>


<div id="outline-container-org086d0fa" class="outline-2">
<h2 id="org086d0fa"><span class="section-number-2">3</span> echo cat spong</h2>
<div class="outline-text-2" id="text-3">
<p>
The moreutils have a nice tool called sponge:
</p>

<p>
echo "task goes here" | cat - todo.txt | sponge todo.txt
</p>

<p>
<a href="https://superuser.com/questions/246837/how-do-i-add-text-to-the-beginning-of-a-file-in-bash">https://superuser.com/questions/246837/how-do-i-add-text-to-the-beginning-of-a-file-in-bash</a></p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>